loadTest.yml
config:
  target: "https://gameon.world"
  processor: "./loadTest.js"
  phases:
    - duration: 4
      arrivalRate: 20
  variables:
    gameID: "446721268"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - function: "generateRandomData"
    - function: "incrementNum"
    - get:
        url: "/joinQuiz?game_id={{gameID}}&name={{name}}{{num}}"
    - log: "Adding user {{name}}{{num}}"

    - think: 10
    - get:
        url: "/userScreen?question=1"
    - log: "Now getting a screen {{name}}"
    - think: 5
    - post:
        url: "/submitAnswer"
        form:
          name: "{{name}}"
          game_id: "{{gameID}}"
          questionNumber: "1"
          user_id: "{{ id }}"
          answer: "{{ answer }}"
          color: "ff0000"
    - log: "Sent a request to /users with {{ name }}, {{ id  }}, {{ answer }}"